const funnyRoles = ["椅子带王", "卓别林", "赵本山", "曹云金"];
const lowComedyRoles = ["戴志诚", "师胜杰", "高峰", "苏文茂"];
const highComedyRoles = ["侯宝林", "马季", "侯耀文"];
const clownComedyRoles = ["大兵", "张云雷", "马志明", "常宝华", "高晓攀", "尚九熙","刘云天","张伯鑫"];
const allRoles = [
    "张寿臣",
    "椅子带王",
    "卓别林",
    "赵本山",
    "曹云金",
    "戴志诚",
    "师胜杰",
    "高峰",
    "苏文茂",
    "侯宝林",
    "马季",
    "侯耀文",
    "大兵",
    "张云雷",
    "马志明",
    "常宝华",
    "高晓攀",
    "尚九熙",
    "刘云天",
    "张伯鑫"
    ];

const rolesPartyDict = {
    "张寿臣" : 1,
    "椅子带王" : 1,
    "卓别林" : 1,
    "赵本山" : 1,
    "曹云金" : 1,
    "戴志诚" : 0,
    "师胜杰" : 0,
    "高峰" : 0,
    "苏文茂" : 0,
    "侯宝林" : 0,
    "马季" : 0,
    "侯耀文" : 0,
    "大兵" : 0,
    "张云雷" : 0,
    "马志明" : 0,
    "常宝华" : 0,
    "高晓攀" : 0,
    "尚九熙" : 0,
    "刘云天" : 0,
    "张伯鑫" : 0,
    };

const shortName = {
    "张寿臣"   : "臣",
    "椅子带王"  : "椅",
    "卓别林"   : "卓",
    "赵本山"   : "赵",
    "曹云金"   : "曹",
    "戴志诚"   : "戴",
    "师胜杰"   : "师",
    "高峰"    : "峰",
    "苏文茂"   : "苏",
    "侯宝林"   : "林",
    "马季"    : "季",
    "侯耀文"   : "耀",
    "大兵"    : "兵",
    "张云雷"   : "雷",
    "马志明"   : "明",
    "常宝华"   : "常",
    "高晓攀"   : "攀",
    "尚九熙"   : "熙"
}

const backgroundColour = ["blue", "red"];
const alivenessColour = ["#36FF4F", "#5FA067", "#3D3D3D"];

